In [3]:
import pandas as pd
import numpy as np

# 랜덤 데이터 생성
df = pd.DataFrame(
    np.random.randint(1, 11, size=(5, 5)),
    columns=['A', 'B', 'C', 'D', 'E']
)

df.head()

    A   B  C  D   E
0   5   8  4  6  10
1   5   5  1  9   2
2   4  10  9  6   7
3   5   2  7  7   4
4  10   6  6  2   6

In [4]:
df_g = df.groupby(['A']).count().sort_values('B', ascending=False) #.index[1:3].to_list()
df_g

    B  C  D  E
A
5   3  3  3  3
4   1  1  1  1
10  1  1  1  1

In [5]:
np.random.seed(1234)

income = np.random.randint(30000, 150001, size=100)
education_levels = ['High School', 'Associate', 'Bachelor', 'Master', 'PhD']
education = np.random.choice(education_levels, size=100)
marital_status = np.random.choice([True, False], size=100)

df = pd.DataFrame({
    'INCOME': income,
    'EDUCATION': education,
    'MARITAL_STATUS': marital_status
})

df.head()

   INCOME EDUCATION  MARITAL_STATUS
0  122975  Bachelor           False
1   88067  Bachelor            True
2   64086       PhD           False
3   90620       PhD           False
4  119460  Bachelor           False

In [6]:
# EDUCATION별 INCOME의 평균값을 집계하고, 집계된 평균값이 INCOME의 전체 평균보다 큰 경우 확인
income_mean = df['INCOME'].mean()
income_mean

88964.67

In [7]:
df_g = df.groupby('EDUCATION')['INCOME'].mean().reset_index()
df_g

     EDUCATION        INCOME
0    Associate  90130.793103
1     Bachelor  91088.722222
2  High School  86510.947368
3       Master  85473.714286
4          PhD  90136.850000

In [8]:
answer = list(df_g.loc[df_g['INCOME'] > income_mean, 'EDUCATION'])
answer

['Associate', 'Bachelor', 'PhD']

In [9]:
###################################################################################

In [ ]:
# transform
# 그룹별 연산 결과를 원래의 인덱스와 동일하게 유지하면서 열을 확장j

In [10]:
df = pd.DataFrame({
    'group': ['A', 'A', 'A', 'B', 'B', 'B'],
    'value': [10, 20, 30, 15, 25, 35]
})

df

  group  value
0     A     10
1     A     20
2     A     30
3     B     15
4     B     25
5     B     35

In [14]:
df.groupby('group')['value'].quantile(0.25)

group
A    15.0
B    20.0
Name: value, dtype: float64

In [15]:
df.groupby('group')['value'].transform(lambda x: x.quantile(0.25))

0    15
1    15
2    15
3    20
4    20
5    20
Name: value, dtype: int64